#+TITLE: Manipulate Proof Trees
#+OPTIONS: tex:t
#+STARTUP: latexpreview
#+LATEX_HEADER: \usepackage{qtree,tiks}


*** Convert individual theorem tree to graph

#+BEGIN_SRC python :session :results output silent

cic_constructors = ['App', 'Definition', 'Axiom', 'Lambda',
                    'Cast', 'LetIn','Fix','CoFix',
                    'CaseMatch', 'CaseBranches','Sort',
                    'Prod','Inductive','Case','CoInductive',
                    'Record','VMCast','DEFAULTcast','REVERTcast',
                    'NATIVEcast','Var','Meta','Evar','Rel','Level',
                    'Max','Universe','UnivInstance','Sort','Prop','Type',
                    'Functions','Proj','Name','Anonymous']

cic_regex = re.compile("^"+"|".join(cic_constructors))

def constructorMatch(test, constructor):
    return constructor == test[:len(constructor)]

assert(constructorMatch('App1','App'))
assert(not constructorMatch('App','App1'))

def isConstructor(test):
    return bool(cic_regex.match(test))

assert(isConstructor('App1'))
assert(isConstructor('Lambda2'))
assert(isConstructor('Cast'))

def isShallowSubgraph(dag1, dag2):
    constructor, children = next(iter(dag1.items()))
    for k2 in dag2:
        #if isConstructor(k2) and constructorMatch(k2, constructor) and children == dag2[k2]:
        if constructorMatch(k2, constructor) and children == dag2[k2]:
            return k2
    return False

assert(isShallowSubgraph({'App':{'1','2'}}, {'App1':{'1','2'}}) == 'App1')
assert(not isShallowSubgraph({'App':{'1','2'}}, {'App1':{'1','3'}}))

#+END_SRC


#+BEGIN_SRC python :session :results output

def convToDAG(tree, out_dag = {}, cic_count = {constr: 0 for constr in cic_constructors}):
    if not isinstance(tree, list):
        out_dag[tree] = set()
        return out_dag, tree, cic_count
    else:
       root, children = tree[0], tree[1:]
       mod_child_names = []
       for child in children:
           out_dag, name, cic_count = convToDAG(child, out_dag, cic_count)
           mod_child_names.append(name)
       new_dag = {root: set(mod_child_names)}
       root_new = isShallowSubgraph(new_dag, out_dag)
       if not root_new:
           cic_count[root] += 1
           root_new = root + str(cic_count[root])
           out_dag[root_new] = set(mod_child_names)
    return out_dag, root_new, cic_count

def toDAG(tree):
    dag, rt_name, cic_count = convToDAG(tree, {}, {constr: 0 for constr in cic_constructors})
    return dag

def checkEq(d1, d2):
    if d1.keys() != d2.keys():
        return False
    for k in d1:
        if d1[k] != d2[k]: return False
    return True


a = ['App','2','2']
b = ['App','2',a]
c = ['App',b,b]

# did we want this (App3)?
assert(checkEq(toDAG(c),
               {'2': set(), 'App1': {'2'}, 'App2': {'2', 'App1'}, 'App3': {'App2'}}))

assert(checkEq(
        toDAG(ev_4_tree[1][2]),
        {'ev_SS': set(), '2': set(), 'ev_4.ev_2': set(), 'App1': set(['ev_SS', '2', 'ev_4.ev_2'])}))

assert(checkEq(toDAG(['App',['App','2','2'],['App','2','2']]),
               {'2': set(), 'App1': {'2'}, 'App2': {'App1'}}))

assert(checkEq(
        toDAG(['App', ['App', '2', '2'], ['App', '2', ['App', '2', '2']]]),
        {'2': set(), 'App1': {'2'}, 'App2': {'App1', '2'}, 'App3': {'App2', 'App1'}}
       ))

#+END_SRC

#+RESULTS:
   {'App3': {'App', '2'}}, {'App4': {'App3', 'App2'}}]

**** Create tree from library name

#+BEGIN_SRC python :session :results output
def libNameToTree(library_name, debug=False):
    lib_location = "./ProofTrees/StdLib/" + library_name
    if not os.path.exists(lib_location):
        subprocess.run(["./lib_to_trees.sh", library_name])
    theorem_names = list(map(lambda x: x[:-4], os.listdir(lib_location)))
    #print(theorem_names)
    theorem_lsts = []
    for theorem_name in theorem_names:
        try:
            theorem_lsts.append(libTheoremNameToLists(theorem_name, library_name)[1][2])
        except:
            print("out")
    return ["Top", theorem_lsts]

printTree(libNameToTree("Arith"), 3)

#+END_SRC

#+RESULTS:
#+begin_example
out
out
out
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
  File "/tmp/babel-Wx2Di4/python-EVab2M", line 15, in <module>
    printTree(libNameToTree("Arith"), 3)
  File "/tmp/babel-Wx2Di4/python-gKkeqY", line 24, in printTree
    for x in printTreeHelper(tree):
  File "/tmp/babel-Wx2Di4/python-gKkeqY", line 21, in printTreeHelper
    return [h] + concat([list(map(lambda x: "+---"+x, printTreeHelper(x))) for x in t])
  File "/tmp/babel-Wx2Di4/python-gKkeqY", line 21, in <listcomp>
    return [h] + concat([list(map(lambda x: "+---"+x, printTreeHelper(x))) for x in t])
  File "/tmp/babel-Wx2Di4/python-gKkeqY", line 21, in <lambda>
    return [h] + concat([list(map(lambda x: "+---"+x, printTreeHelper(x))) for x in t])
TypeError: must be str, not list
#+end_example

